app/Http/Livewire/Tables/LeadsTable.php

select * from `leads` where `leads`.`id` = '3' and `leads`.`deleted_at` is null limit 1
---
    public function columns()
    {
        return [
            Column::name("name")->label("Name")->searchable(),
            Column::name("email")->label("Email")->searchable(),
            Column::callback(['phone_code', 'phone'], function($phoneCode, $phone){
                return $phoneCode . $phone;
            })->label("Phone")->searchable(),
            Column::name("address")->label("Address"),
            Column::callback('id', function($id){
                $tags = Lead::find($id)->tags;
                $tagstr = '';
                foreach($tags as $item){
                    $tagstr .= '<div class="chip mr-1">
                                <div class="chip-body">
                                    <span class="chip-text">'.$item->name.'</span>
                                </div>
                            </div>';
                }

                $segments = Lead::find($id)->segments;