app/Http/Livewire/Tables/ProjectTable.php

    public function columns()
    {
        return [
            Column::name('title')->searchable(),
            Column::name('applicant_name')->searchable(),
            Column::callback(['anticipated_budget'], function($value){
                return '$'.number_format((float)$value, 2, '.', '');
            })->label('anticipated_budget'),
            // Column::name('anticipated_budget')->searchable(),
            Column::name('project_address')->searchable(),
            Column::name('project_state')->searchable(),
            // Column::name('phone')->searchable(),
            Column::callback(['phone', 'phone_code'], function($phone,$phone_code){
                return $phone_code.$phone;
            })->label('phone'),
            Column::name('email')->searchable(),
            // Column::name('current_property_value')->searchable(),
            Column::callback(['current_property_value'], function($value){
                return '$'.number_format((float)$value, 2, '.', '');
            })->label('current_property_value'),
            // Column::name('property_debt'),
            Column::callback(['property_debt'], function($value){
                return '$'.number_format((float)$value, 2, '.', '');
            })->label('current_property_value'),
            Column::callback(['cross_collaterized'], function($value){
                return $value ? 'Yes' : 'No';
            })->label('Cross Collaterized'),
            Column::callback(['user_id'], function($userId){
                return User::find($userId)->name ?? '';
            })->label('Partners'),
            Column::callback(['lead_user_id'], function($userId){
                return User::find($userId)->name ?? "Not Assigned";
            })->label('Home Owner'),
---
select * from `users` where `users`.`id` = '1' limit 1