app/Http/Livewire/LiveProjectDetailComponent.php

    public function getEventLog()
    {
        $this->eventLogs  = EventLog::where('project_id', $this->project->id)->get();
---
select * from `event_logs` where `project_id` = 34 order by `id` desc

    public function getTeam()
    {
        $this->team = ProjectAccess::where('project_id', $this->project->id)->get();
---
select * from `project_accesses` where `project_id` = 34

    public function mount(Request $request, Project $project)
    {
        // dd('ads');
        $this->roles = config('roles.projectRoles');
        $this->homeOwnerRoles = config('roles.homeownerroles');
        // dd($this->homeOwnerRoles);
        $this->builderRoles = config('roles.builderroles');
        $this->franchiseRoles = config('roles.franchiseroles');
        // dd($this->franchiseRoles);
        $this->valuerRoles = config('roles.valuerroles');
        $this->user = Auth::user();

        $this->getTeam();
        $this->project = $project;
        $this->getProjectTimeline();
        $this->tasks = Event::with('attachedUser', 'attachedLead', 'createdBy')->where('project_id', $this->project->id)->get();
        $this->leads = Lead::when($this->user->user_type != 'admin', function($q){
            $q->where('user_id', Auth::id());
        })->get();
        $this->users = User::when($this->user->user_type != 'admin', function($q){
            $q->where('created_by', Auth::id());
        })->get();
        $this->projectAccess = ProjectAccess::where('user_id', $this->user->id)->where('project_id', $this->project->id)->first();
        // dd($this->projectAccess->roles['add_value']);
        $this->finalProgress = Progress::where('project_id', $this->project->id)->where('final_progress', 1)->first();
        $this->client_satisfied = Progress::where('project_id', $this->project->id)->where('client_satisfied', 1)->first();
---
select * from `events` where `project_id` = 34 order by `id` desc
select * from `users`
select * from `leads` where `leads`.`deleted_at` is null
select * from `project_accesses` where `user_id` = 1 and `project_id` = 34 limit 1
select * from `progress` where `project_id` = 34 and `final_progress` = 1 limit 1
select * from `progress` where `project_id` = 34 and `client_satisfied` = 1 limit 1

    public function getProjectTimeline()
    {
        $this->timeLine = Progress::where('project_id', $this->project->id)->get();
        $this->finalProgressReviews = Progress::where('project_id', $this->project->id)->whereIn('client_satisfied', [0,1])->get();
---
select * from `progress` where `project_id` = 34 order by `id` desc
select * from `progress` where `project_id` = 34 and `client_satisfied` in (0, 1)