app/Http/Livewire/LiveProjectComponent.php

select * from `projects` where `user_id` = 1
---
    public function mount()
    {
        $this->user = Auth::user();
        $this->model = new Project();
        $this->model['phone_code']  = 61;
        $this->model->cross_collaterized = 0;
        $this->homeowers = User::homeowners()->get();
        $this->model->cross_collaterized = false;
        $this->projects = Project::where('user_id', Auth::id())->get();

update `projects` set `user_id` = 1, `approved` = 'approved', `projects`.`updated_at` = '2023-03-08 09:25:28' where `id` = 34
---
        {
            $project->approved = 'pending';
        }
        $project->update();