app/Http/Livewire/LiveLeadComponent.php

select * from `segments`
select * from `tags`
---
    public function mount()
    {
        $this->user = Auth::user();

        if(!$this->user->hasRole('view-leads')) abort(403);

        $this->segments = Segment::all();
        $this->tags = Tag::all();

select * from `lead_segments` where `lead_id` = 3
delete from `lead_segments` where `id` = 7
select `id` from `lead_segments` where `lead_id` = 3
---
    public function update()
    {
        $this->validate([
            'name' => 'required',
            'email' => 'required|email|unique:users,email,'.$this->model->id,
            'address' => 'required',
            'phone_code' => 'required',
            'phone' => 'required',
        ]);

        $this->model->name = $this->name;
        $this->model->email = $this->email;
        $this->model->phone_code = $this->phone_code;
        $this->model->phone = $this->phone;
        $this->model->address = $this->address;

        $this->model->update();


        collect(LeadSegment::where('lead_id', $this->model->id)->get())->map(function($item, $index) {
            if(!in_array($item->id, $this->selectedSegments ?? [])){
                $item->delete();
            }
        });

        collect($this->selectedSegments)->map(function($item, $index){
            if(!in_array($item, LeadSegment::where('lead_id', $this->model->id)->pluck('id')->toArray())){

select * from `lead_tags` where `lead_id` = 3
select `id` from `lead_tags` where `lead_id` = 3
---
        });


        collect(LeadTag::where('lead_id', $this->model->id)->get())->map(function($item, $index) {
            if(!in_array($item->id, $this->selectedTags ?? [])){
                $item->delete();
            }
        });

        collect($this->selectedTags)->map(function($item, $index){
            if(!in_array($item, LeadTag::where('lead_id', $this->model->id)->pluck('id')->toArray())){