app/Http/Controllers/EventsController.php

    public function list(Request $request)
    {
        return [
            'message' => 'success',
            'data' => Event::where('user_id', Auth::user()->id)->get()
---
select * from `events` where `user_id` = 1