app/Models/Lead.php

    public function getSegmentsAttribute()
    {
        return LeadSegment::where('lead_id', $this->id)->join('segments', 'segments.id', 'lead_segments.segment_id')->select('segments.*')->get();
---
select `segments`.* from `lead_segments` inner join `segments` on `segments`.`id` = `lead_segments`.`segment_id` where `lead_id` = 2

    public function getTagsAttribute()
    {
        return LeadTag::where('lead_id', $this->id)->join('tags', 'tags.id', 'lead_tags.tag_id')->select('tags.*')->get();
---
select `tags`.* from `lead_tags` inner join `tags` on `tags`.`id` = `lead_tags`.`tag_id` where `lead_id` = 2