app/Models/PaymentRequest.php

select * from `projects` where `projects`.`id` = 3 limit 1
---
    public function getProjectAttribute()
    {
        return Project::find($this->project_id)->only([
            'id',
            'title',
            'description',
            'cover_photo',
            'project_address'
        ]);