app/Models/Project.php

    public function getProgressReviewedAttribute()
    {
        $progress = Progress::where("project_id", $this->id)->orderByDesc('id')->first();
---
select * from `progress` where `project_id` is null order by `id` desc limit 1

    public function getEvaluationReviewedAttribute()
    {
        $progress = PropertyValue::where("project_id", $this->id)->orderByDesc('id')->first();
---
select * from `property_values` where `project_id` is null order by `id` desc limit 1

    public function getBuildersAttribute()
    {
        if($this->id != null){
            return User::join('project_accesses',function($join){
                $join->on('project_accesses.project_id', \DB::raw($this->id));
                $join->on('project_accesses.user_id', 'users.id');
            })->select('users.*', 'project_accesses.roles')->where('user_type', 'builder')->get();
---
select `users`.*, `project_accesses`.`roles` from `users` inner join `project_accesses` on `project_accesses`.`project_id` = 1 and `project_accesses`.`user_id` = `users`.`id` where `user_type` = 'builder'

    public function getEvaluatorsAttribute()
    {
        if($this->id != null){
            return User::join('project_accesses',function($join){
                $join->on('project_accesses.project_id', \DB::raw($this->id));
                $join->on('project_accesses.user_id', 'users.id');
            })->select('users.*', 'project_accesses.roles')->where('user_type', 'evaluator')->get();
---
select `users`.*, `project_accesses`.`roles` from `users` inner join `project_accesses` on `project_accesses`.`project_id` = 1 and `project_accesses`.`user_id` = `users`.`id` where `user_type` = 'evaluator'

    public function getActionRequiredAttribute()
    {
        if(!request()->user()){
            return [];
        }

        $user = request()->user();
        $scopes = ProjectAccess::where('user_id', $user->id)->where('project_id', $this->id)->first()->roles ?? [];
---
select * from `project_accesses` where `user_id` = 1 and `project_id` is null limit 1

    public function getFranchiseeAttribute()
    {
        $user = User::find($this->user_id);
        if(!$user) return null;
        $roles = ProjectAccess::where('user_id', $this->user_id)->where('project_id', $this->id)->first();
---
select * from `users` where `users`.`id` is null limit 1
select * from `project_accesses` where `user_id` = 1 and `project_id` = 1 limit 1

    public function getLeadAttribute()
    {
        if($this->id){
            return User::join('project_accesses',function($join){
                $join->on('project_accesses.project_id', \DB::raw($this->id));
                $join->on('project_accesses.user_id', 'users.id');
            })->select('users.*', 'project_accesses.roles')->where('user_type', 'home-owner')->get();
---
select `users`.*, `project_accesses`.`roles` from `users` inner join `project_accesses` on `project_accesses`.`project_id` = 1 and `project_accesses`.`user_id` = `users`.`id` where `user_type` = 'home-owner'

    public function getProjectRolesAttribute()
    {
        $allRoles = config('roles.projectRoles');
        $roles = ProjectAccess::where('project_id', $this->id)->where('user_id', request()->user()->id ?? 0)->first();
---
select * from `project_accesses` where `project_id` is null and `user_id` = 1 limit 1

    public function getAssignedAttribute()
    {
        return ProjectAccess::where('project_id', $this->id)->first() ? true : false;
---
select * from `project_accesses` where `project_id` is null limit 1

    public function getProgressSatisfiedAttribute()
    {
        $progress = Progress::where("project_id", $this->id)->orderByDesc('id')->first();
---
select * from `progress` where `project_id` is null order by `id` desc limit 1

    public function getEvaluationSatisfiedAttribute()
    {
        $evaluation = PropertyValue::where('project_id', $this->id)->orderByDesc('id')->first();
---
select * from `property_values` where `project_id` is null order by `id` desc limit 1

    public function getFinalProgressReviewsAttribute()
    {
        $progress = Progress::where("project_id", $this->id)->orderByDesc('id')->first();
---
select * from `progress` where `project_id` is null order by `id` desc limit 1

    public function getEvaluationReviewsAttribute()
    {
        $value = PropertyValue::where("project_id", $this->id)->orderByDesc('id')->first();
---
select * from `property_values` where `project_id` is null order by `id` desc limit 1

    public function getLatestPaymentRequestAttribute()
    {
        return PaymentRequest::with('user')->where('project_id', $this->id)->orderByDesc('id')->first();
---
select * from `payment_requests` where `project_id` is null order by `id` desc limit 1
select * from `users` where `users`.`id` in (73)

    public function getLatestProgressAttribute()
    {
        return Progress::with('user')->where('project_id', $this->id)->orderByDesc('id')->first();
---
select * from `progress` where `project_id` is null order by `id` desc limit 1
select * from `users` where `users`.`id` in (73)

    public function getLatestNoteAttribute()
    {
        return Note::with('user')->where('project_id', $this->id)->orderByDesc('id')->first();
---
select * from `notes` where `project_id` is null order by `id` desc limit 1
select * from `users` where `users`.`id` in (73)

    public function getLatestValueAttribute()
    {
        $value = PropertyValue::where('project_id', $this->id)->orderByDesc('id')->first();
        if($value) return $value->value;
---
select * from `property_values` where `project_id` is null order by `id` desc limit 1